const { MessageType } = ('@adiwajshing/baileys')
let handler = async (m, { conn }) => {
    let _uptime = process.uptime() * 1000
    let uptime = clockString(_uptime)

conn.sendMessage(m.chat,`
*✧ ⃟ ⃟ ━━━ೋۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡⸙🇲🇨ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡⸙ೋ━━━ ⃟ ⃟ ✧*
*♦༒☠ BOT WHATSAPP  ☠༒♦*
*✧ ⃟ ⃟ ━━━ೋ๑ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡⸙🇲🇨ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡⸙ೋ━━━ ⃟ ⃟ ✧*
⋱ ⋮ ⋰
⋯ ◯ ⋯ ︵ 　　　　　　^v^
¸︵︵( ░░ )︵.︵.︵
(´░░░░░░ ') ░░░' )
 ︶ ¯ ︶ ︶ ︶ 　^v^　　^v^
╔┓┏╦━━╦┓╔┓╔━━╗╔╗
║┗┛║┗━╣┃║┃║╯╰║║║
║┏┓║┏━╣┗╣┗╣╰╯║╠╣
╚┛┗╩━━╩━╩━╩━━╝╚╝
*╭─̇─̇─̇─̇──̇─̇─̇─↷LoadingData*
*│[_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅] 2O%*
*│🥀*
*│[_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅] 4O%*
*│BOT📍*
*│[_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅] 6O%* 
*│XYZ666X🔥*
*│[_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅] 8O%* 
*│ACA CANS HERE🐣🐣*
*│[_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅]1OO%*
*│*
*╰─̇─̇─̇──̇─̇─̇─̇─̇─̇─̇─̇─̇─̇─̇─̇─̇─̇─̇─̇➤*
 °°°🕊°°°°°°°🕊°°°°°°°°🕊°°°°°°°°°°°🕊°°°°°°°
■□■□■□■□■□■□■□■□ 🕊
▣▣▣▣▣▣▣▣▣▣▣▣▣▣▣▣▣▣🕊
❏ ❐            •                                     ⁙
           ❑ ❒           •                                ⁙
                     ❏ ❐           •
                              ❏ ❐            •
                                        ❑ ❒
*︻⋆︻⋆︻⋆︻⋆︻⋆︻⋆︻⋆︻⋆︻⋆︻⋆︻⋆*
   *꒰ ۝ٜٜٜٜٜٜ◆ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟   ⃟ ♧ ⃟  ◆ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟   ۝ ꒱*
*︼⋆︼⋆︼⋆︼⋆︼⋆︼⋆︼⋆︼⋆︼⋆︼⋆︼⋆*
╭━━•°҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡⸙  ⃟ ҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡⸙─ೇุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุุ  ⃟ ҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡⸙  ⃟ ҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡⸙ ⃟  ⃟ ҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡━━━━━╮
┃ *─★་‧ﾟ✵･･･─ ⋆⃟⊱✪⃝⃞⃝⊰⋆⃟⋆ ⋆⋆⃟⊱✪⃝⃞⃝⊰ ⋆*
┃ *XyZ666x : ↷↷*
┃╭┈─────────────⩵꙰ཱི࿐
┃╰──STATUS BOT!*──➤ ↶↷*
┃ *⸙ ુོ➪ Aktif Selama
┃ *⸙ ુོ➪ ${uptime}
┃ 
┃ *─★‧ﾟ✵･･･─ ⋆⃟⊱✪⃝⃞⃝⊰⋆⃟⋆ ⋆⋆⃟⊱✪⃝⃞⃝⊰ ⋆*
╰━━━━━━━━━━━━━━━━━━━━━╯
*︻⋆︻⋆︻⋆︻⋆︻⋆︻⋆︻⋆︻⋆︻⋆︻⋆︻⋆*
   *꒰ ۝ٜٜٜٜٜٜ◆ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟   ⃟ ♧ ⃟  ◆ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟   ۝ ꒱*
*︼⋆︼⋆︼⋆︼⋆︼⋆︼⋆︼⋆︼⋆︼⋆︼⋆︼⋆*

*━━━ೋ๑୨۝୧๑ೋ━━━ ⃟ ⃟ ✧*
For plagiator: Saya yakin, anda punya kreativitas sendiri. Jika anda msh saja mencopas list kami, apa gunanya otak anda:)
*━━━ೋ๑୨۝୧๑ೋ━━━ ⃟ ⃟ ✧*
    `, MessageType.text, ci1fdocs )
}
handler.help = ['uptime']
handler.tags = ['info']
handler.command = /^(uptime)$/i

module.exports = handler

function clockString(ms) {
    let h = isNaN(ms) ? '--' : Math.floor(ms / 3600000)
    let m = isNaN(ms) ? '--' : Math.floor(ms / 60000) % 60
    let s = isNaN(ms) ? '--' : Math.floor(ms / 1000) % 60
    return [h, m, s].map(v => v.toString().padStart(2, 0)).join(':')
}